1G_Air_Vehicle_Hotel/RailRefundReq-1G.txt


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<RailRefundReq TargetBranch="P3213213" RetrieveProviderReservationDetails="true" LocatorCode="35OBKY" RefundOption="Refund" xmlns="http://www.travelport.com/schema/rail_v50_0"/>
	</soap:Body>
</soap:Envelope>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<rail:RailRefundRsp xmlns:rail="http://www.travelport.com/schema/rail_v50_0" xmlns:common_v50_0="http://www.travelport.com/schema/common_v50_0" TransactionId="ACDAA6010A0759BFAD610628FDE757BE" ResponseTime="8956">
			<common_v50_0:Payment Key="191725016" Type="Itinerary" Amount="USD-182.00" FormOfPaymentRef="208672435"/>
		</rail:RailRefundRsp>
	</SOAP:Body>
</SOAP:Envelope>|
